#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.web_apps.module.citizen_func_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.web_apps.module.etl_func_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.container_apps.azurerm_key_vault_access_policy.reminder_kv_messages will be created
  + resource "azurerm_key_vault_access_policy" "reminder_kv_messages" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-messages-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-messages-kv"
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.container_apps.module.reminder_ca_itn_01.azurerm_container_app.this will be created
  + resource "azurerm_container_app" "this" {
      + container_app_environment_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.App/managedEnvironments/io-p-itn-com-cae-01"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "io-p-itn-reminder-ca-01"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "io-p-itn-com-rg-01"
      + revision_mode                 = "Single"
      + tags                          = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + workload_profile_name         = "Consumption"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + ingress {
          + allow_insecure_connections = false
          + custom_domain              = (known after apply)
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8080
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas                     = 1
          + min_replicas                     = 0
          + revision_suffix                  = (known after apply)
          + termination_grace_period_seconds = 0

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "mcr.microsoft.com/k8se/quickstart:latest"
              + memory            = "0.5Gi"
              + name              = "quickstart"

              + env {
                  + name  = "BOOTSTRAP_SERVER_MESSAGE"
                  + value = "io-p-messages-weu-prod01-evh-ns.servicebus.windows.net:9093"
                }
              + env {
                  + name  = "BOOTSTRAP_SERVER_MESSAGESEND"
                  + value = "io-p-messages-weu-prod01-evh-ns.servicebus.windows.net:9093"
                }
              + env {
                  + name  = "BOOTSTRAP_SERVER_MESSAGESTATUS"
                  + value = "io-p-messages-weu-prod01-evh-ns.servicebus.windows.net:9093"
                }
              + env {
                  + name  = "BOOTSTRAP_SERVER_SHARED"
                  + value = "io-p-payments-weu-prod01-evh-ns.servicebus.windows.net:9093"
                }
              + env {
                  + name  = "ENABLE_QUARTZ"
                  + value = "true"
                }
              + env {
                  + name  = "ENABLE_REST_KEY"
                  + value = "true"
                }
              + env {
                  + name  = "IO_NOTIFY_ENDPOINT"
                  + value = "https://api-internal.io.italia.it/api/v1/messages-sending/internal"
                }
              + env {
                  + name  = "IS_ACTIVE_MESSAGESEND_CONSUMER"
                  + value = "true"
                }
              + env {
                  + name  = "IS_ACTIVE_MESSAGESTATUS_CONSUMER"
                  + value = "true"
                }
              + env {
                  + name  = "IS_ACTIVE_MESSAGE_CONSUMER"
                  + value = "true"
                }
              + env {
                  + name  = "IS_ACTIVE_PAYMENT_CONSUMER"
                  + value = "true"
                }
              + env {
                  + name  = "KAFKA_MESSAGE"
                  + value = "messages"
                }
              + env {
                  + name  = "KAFKA_PAYMENT"
                  + value = "payment-updates"
                }
              + env {
                  + name  = "KAFKA_SEND"
                  + value = "message-reminder-send"
                }
              + env {
                  + name  = "KAFKA_STATUS"
                  + value = "message-status"
                }
              + env {
                  + name  = "MAIN_LOGGING_LEVEL"
                  + value = "WARN"
                }
              + env {
                  + name  = "MAX_PAID_MESSAGE"
                  + value = "4"
                }
              + env {
                  + name  = "MAX_READ_MESSAGE"
                  + value = "3"
                }
              + env {
                  + name  = "MONGO_DATABASE"
                  + value = "db"
                }
              + env {
                  + name  = "PAYMENTUPDATER_ENDPOINT"
                  + value = "https://api-app.internal.io.pagopa.it"
                }
              + env {
                  + name  = "PAYMENT_DAY"
                  + value = "3"
                }
              + env {
                  + name  = "PROXY_ENDPOINT"
                  + value = "https://api.platform.pagopa.it/checkout/auth/payments/v1"
                }
              + env {
                  + name  = "PROXY_ERROR_STATUSCODE"
                  + value = "PAA_PAGAMENTO_DUPLICATO,PPT_RPT_DUPLICATA,PPT_PAGAMENTO_DUPLICATO"
                }
              + env {
                  + name  = "QUARTZ_IDLE_CONNECTIONS_TIMEOUT"
                  + value = "10000"
                }
              + env {
                  + name  = "QUARTZ_MAXIMUM_POOL_SIZE"
                  + value = "10"
                }
              + env {
                  + name  = "QUARTZ_MINIMUM_IDLE_CONNECTIONS"
                  + value = "5"
                }
              + env {
                  + name  = "QUARTZ_SCHEDULER_TIMER_DELETE"
                  + value = "0 * * ? * *"
                }
              + env {
                  + name  = "QUARTZ_SCHEDULER_TIMER_NOTIFY"
                  + value = "0 0/10 8-20 ? * *"
                }
              + env {
                  + name  = "REMINDER_DAY"
                  + value = "3"
                }
              + env {
                  + name  = "REMINDER_GENERIC_MAX_PAGE_SIZE"
                  + value = "1000"
                }
              + env {
                  + name  = "REMINDER_PAYMENT_MAX_PAGE_SIZE"
                  + value = "400"
                }
              + env {
                  + name  = "RESTCALL_INTERVAL_FUNCTION"
                  + value = "10000"
                }
              + env {
                  + name  = "RESTCALL_MAX_ATTEMPTS"
                  + value = "3"
                }
              + env {
                  + name  = "SASL_MECHANISM_REMINDER"
                  + value = "PLAIN"
                }
              + env {
                  + name  = "SASL_MECHANISM_SHARED"
                  + value = "PLAIN"
                }
              + env {
                  + name  = "SCHEDULER_REMINDER_DELETE_ACTIVE"
                  + value = "false"
                }
              + env {
                  + name  = "SCHEDULER_REMINDER_NOTIFY_ACTIVE"
                  + value = "true"
                }
              + env {
                  + name  = "SECURITY_PROTOCOL_REMINDER"
                  + value = "SASL_SSL"
                }
              + env {
                  + name  = "SECURITY_PROTOCOL_SHARED"
                  + value = "SASL_SSL"
                }
              + env {
                  + name  = "SENDER_DEPARTMENT_NAME"
                  + value = "AppIO"
                }
              + env {
                  + name  = "SENDER_ORGANIZATION_NAME"
                  + value = "PagoPA"
                }
              + env {
                  + name  = "SENDER_SERVICE_NAME"
                  + value = "Reminder"
                }
              + env {
                  + name  = "START_DAY"
                  + value = "13"
                }
              + env {
                  + name  = "TEST_ACTIVE"
                  + value = "false"
                }
              + env {
                  + name  = "WEBSITE_SITE_NAME"
                  + value = "io-p-weuprod01-reminder-ms"
                }
              + env {
                  + name        = "APPLICATIONINSIGHTS_CONNECTION_STRING"
                  + secret_name = "applicationinsights-connection-string"
                }
              + env {
                  + name        = "MONGO_DATABASE_URI"
                  + secret_name = "mongo-database-uri"
                }
              + env {
                  + name        = "KAFKA_URL_MESSAGE"
                  + secret_name = "kafka-url-message"
                }
              + env {
                  + name        = "KAFKA_URL_MESSAGESTATUS"
                  + secret_name = "kafka-url-messagestatus"
                }
              + env {
                  + name        = "KAFKA_URL_MESSAGESEND"
                  + secret_name = "kafka-url-messagesend"
                }
              + env {
                  + name        = "KAFKA_URL_SHARED"
                  + secret_name = "kafka-url-shared"
                }
              + env {
                  + name        = "PROXY_ENDPOINT_SUBSCRIPTION_KEY"
                  + secret_name = "proxy-endpoint-subscription-key"
                }
              + env {
                  + name        = "PAYMENTUPDATER_ENDPOINT_SUBSCRIPTION_KEY"
                  + secret_name = "paymentupdater-endpoint-subscription-key"
                }
              + env {
                  + name        = "IO_NOTIFY_ENDPOINT_SUBSCRIPTION_KEY"
                  + secret_name = "io-notify-endpoint-subscription-key"
                }
              + env {
                  + name        = "MYSQL_URL"
                  + secret_name = "mysql-url"
                }
              + env {
                  + name        = "MYSQL_USER"
                  + secret_name = "mysql-user"
                }
              + env {
                  + name        = "MYSQL_PASSWORD"
                  + secret_name = "mysql-password"
                }
              + env {
                  + name        = "SENDERS_TO_SKIP"
                  + secret_name = "senders-to-skip"
                }
              + env {
                  + name        = "SENDERS_TO_USE"
                  + secret_name = "senders-to-use"
                }

              + liveness_probe {
                  + failure_count_threshold          = 3
                  + initial_delay                    = 60
                  + interval_seconds                 = 10
                  + path                             = "/"
                  + port                             = 8080
                  + termination_grace_period_seconds = (known after apply)
                  + timeout                          = 5
                  + transport                        = "HTTP"
                }
            }
        }
    }

  # module.web_apps.module.citizen_func_autoscaler.azurerm_monitor_autoscale_setting.this will be updated in-place
  ~ resource "azurerm_monitor_autoscale_setting" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-com-citizen-as-01"
        name                = "io-p-itn-com-citizen-as-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      ~ profile {
            name = jsonencode(
                {
                    for  = "low_load_profile"
                    name = "default"
                }
            )

          ~ capacity {
              ~ minimum = 3 -> 6
                # (2 unchanged attributes hidden)
            }

          ~ rule {
              ~ metric_trigger {
                  ~ threshold                = 25 -> 80
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ threshold                = 10 -> 20
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.storage_api_weu.azurerm_storage_container.message_content,
  on ../_modules/storage_accounts/storage_account_api.tf line 32, in resource "azurerm_storage_container" "message_content":
  32:   storage_account_name  = module.storage_api.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
